Missing completely in random (MCAR)

The probability that a value is missing is independent of both observed and unobserved data.
The missingness has nothing to do with the data itself.
It’s essentially pure randomness.

Missing at random (MAR)

The probability that a value is missing is related to observed data, but not the missing value itself.

Missing not at random (MNAR)

The probability that a value is missing is related to the missing value itself, even after considering observed data.

In [1]:
import seaborn as sns

In [48]:
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [49]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [50]:
df.shape

(891, 15)

In [51]:
# Deleting rows with missing values
df.dropna().shape

# Deleting columns with missing values
df.dropna(axis=1).shape

(891, 11)

## Impuation Missing Values

In [52]:
# Mean imputation = normal distribution

df["age_mean"] = df["age"].fillna(df["age"].mean())
df[["age","age_mean"]]

      age   age_mean
0    22.0  22.000000
1    38.0  38.000000
2    26.0  26.000000
3    35.0  35.000000
4    35.0  35.000000
..    ...        ...
886  27.0  27.000000
887  19.0  19.000000
888   NaN  29.699118
889  26.0  26.000000
890  32.0  32.000000

[891 rows x 2 columns]

In [ ]:
# Median imputation = Outlier based imputation

df["age_median"] = df["age"].fillna(df["age"].median())

df[["age_median","age_mean","age"]]

     age_median   age_mean   age
0          22.0  22.000000  22.0
1          38.0  38.000000  38.0
2          26.0  26.000000  26.0
3          35.0  35.000000  35.0
4          35.0  35.000000  35.0
..          ...        ...   ...
886        27.0  27.000000  27.0
887        19.0  19.000000  19.0
888        28.0  29.699118   NaN
889        26.0  26.000000  26.0
890        32.0  32.000000  32.0

[891 rows x 3 columns]

In [55]:
## Mode Imputation

df["embarked_mode"] = df["embarked"].fillna(df["embarked"].mode()[0])
df[["embarked_mode","embarked"]].isnull().sum()

embarked_mode    0
embarked         2
dtype: int64